export default {
  namespaced: true,
  state: {
    block1: {
      title: `Добро пожаловать в «Зорге.Премьер» — уникальный проект «Жилстройинвест Девелопмент».`,
      desc: `
      <p>Комплекс расположен в одном из самых зеленых и спокойных уголков Уфы, в нескольких минутах от парка культуры и отдыха им. М. Гафури.</p
      <p>Роскошная и смелая архитектура «Зорге.Премьер», проектирование без условностей, максимальная функциональность и идеальное воплощение покоряют с первого взгляда и задают новый <br/>Стандарт элитного жилья.</p>`,
      button: { text: '', link: '' }
    },
    block2: {
      title: 'Архитектура',
      desc: `
              <p>«Зорге.Премьер» — дань уважения стилю ар-деко. Элегантная архитектура зданий, изысканные фасады, сводчатые окна и входные группы создают яркий, запоминающийся образ и подчеркивают интеллигентную роскошь.</p>
              <p>Проект разработан архитектурным бюро «Проспект» под руководством Александра Сафарова, автора таких знаковых объектов как «Аристократ», «Символ», IDEL TOWER.</p>
            `,
      button: { text: 'Галерея', link: '/gallery' }
    },
    block3: {
      title: 'Жизнь в окружении парка и леса, рядом с центром',
      desc: `
        <p>Свежий воздух, прогулочные дорожки, зоны отдыха, теннисные корты, спортивные комплексы, конюшня, ледовые катки и лыжня в зимний период — в нескольких минутах от комплекса расположен любимый горожанами и гостями города парк культуры и отдыха им. М. Гафури.</p>
        <p>Прогуляться с семьей или домашним питомцем можно и по «Тропе здоровья», которая берет свое начало буквально в нескольких шагах от дома. Благоустройство тропы реализуется «Жилстройинвест Девелопмент» совместно с Администрацией города в рамках проекта «Уфимское ожерелье».</p>
        `,
      button: { text: 'Расположение', link: '/location' }
    },
    block4: {
      title: 'Концепции квартир',
      desc: `
      <p>Более 60 уникальных планировок на самый взыскательный вкус — это и есть роскошь «Зорге.Премьер». Просторные жилые пространства с гостевыми и приватными зонами, мастер-спальни с собственными гардеробными и санузлами, кладовые, совмещенные с кухней, постирочные и места хранения делают каждую квартиру образцом функциональности и комфорта. Для особо взыскательных — квартиры с собственными террасами.</p>
      <p>Из большинства квартир открываются потрясающие виды на лес, а увеличенные окна наполняют пространство естественным светом. Это ли не мечта?! Жить в сердце города с видом на лесопарковую зону – изысканная роскошь для истинных ценителей!</p>
      <ul class="list-st">
        <li>
          от 1- до 5-комнатных квартир;
        </li>
        <li>
          от 41 до 270 кв.м площадь квартир;
        </li>
        <li>
          от 3,0 до 4,5 м высота потолков.
        </li>
      </ul>
      `,
      button: { text: 'Подробнее', link: '/concepts' }
    },


    block5: {
      title: 'Роскошный двор',
      desc: `<p>Концепция «Зорге.Премьер» — это дружелюбный внешний периметр комплекса и полностью приватный внутренний двор с цветочным садом и ландшафтным дизайном.</p>`,
      button: { text: 'Подробнее', link: '' }
    },
    block6: {
      title: 'Приватность и безопасность',
      desc: `
        <p>Закрытая от посторонних территория комплекса оснащена камерами наблюдения, собственный пункт охраны 24/7 обеспечивает беспрекословный порядок в комплексе.</p>
        <p>Внутренний двор с детскими и спортивными площадками, прогулочными зонами и местами для отдыха станет безопасным пространством для всей семьи.</p>

      `,
      button: { text: '', link: '' }
    },
    block7: {
      title: 'Инфраструктура и сервис',
      desc: `<p>Максимальный комфорт жителей «Зорге.Премьер»  - это небольшие магазины, кафе, пекарни, бьюти-пространства — всё то, что наполнит комплекс уютом и первоклассным сервисом.</p>`,
      button: { text: 'Галерея', link: '/gallery/environment' }
    },
    block8: {
      title: 'Дизайнерские парадные',
      desc: `
        <p>Арочные входы, высокие потолки и роскошные хрустальные люстры, мягкий свет и премиальные материалы в отделке (медь, гранит, мрамор, архитектурный бетон) создают атмосферу утонченного уюта и подчеркивают высокий статус жителей.
        В каждой парадной предусмотрены колясочные, гостевые уборные и места для консьержа.
        </p>
        <p>Деталь, которую оценят те, кто привык к безупречному сервису. Коснитесь носком туфли изящной панели вызова лифта, расположенной у пола, — кабина лифта прибудет мгновенно и бесшумно.</p>
      `,
      button: { text: 'Галерея', link: '/gallery/public-areas' }
    },
    block9: {
      title: 'Инженерия',
      desc: `<p>«Зорге.Премьер» — это проверенные временем производители и современные инженерные системы, которые обеспечивают высочайший уровень безопасности и комфорта для каждого жильца.</p>`,
      button: { text: 'Подробнее', link: '/engineering' }
    },
    block10: {
      title: 'Инженерные решения',
      desc: `<p>Техническая составляющая комплекса соответствует самым современным инженерным решениям.</p>
        `,
      button: { text: 'Подробнее', link: '/engineering' }
    },
    block11: {
      title: 'Технологичный паркинг',
      desc: `
        <p>В новом доме комплекса предусмотрен уникальный двухуровневый подземный паркинг с автомобильным лифтом-подъемником, который делает перемещение между этажами простым и удобным. Этот инновационный подход позволяет рационально использовать пространство, значительно увеличивая вместимость и снижая риски повреждений автомобилей и стен.  </p>
        <ul class="list-st">
          <li>доступ на лифте с любого этажа;</li>
          <li>система распознавания автомобильных номеров;</li>
          <li>передовые системы видеонаблюдения и охраны;</li>
          <li>пожарная сигнализация;</li>
          <li>зарядные устройства для электромобилей.</li>
        </ul>
      `,
      button: { text: '', link: '' }
    },
    block12: {
      title: 'Новые стандарты качества от «Жилстройинвест Девелопмент»',
      desc: `
        <p>«Зорге.Премьер» — это идеальное пространство для жизни:</p>
        <ul class="list-st">
          <li>инновационный подход и эксклюзивные <br/> архитектурные решения;</li>
          <li>продуманное благоустройство и элегантная отделка;</li>
          <li>современные системы безопасности;</li>
          <li>высокотехнологичная инженерия.</li>
        </ul>
      `,
      button: { text: 'О застройщике', link: '/developer' }
    }
  },
  actions: {},
  mutations: {},
  getters: {
    block1: ({block1}) => block1,
    block2: ({block2}) => block2,
    block3: ({block3}) => block3,
    block4: ({block4}) => block4,
    block5: ({block5}) => block5,
    block6: ({block6}) => block6,
    block7: ({block7}) => block7,
    block8: ({block8}) => block8,
    block9: ({block9}) => block9,
    block10: ({block10}) => block10,
    block11: ({block11}) => block11,
    block12: ({block12}) => block12
  }
}
